pertemuan-4/app/Controllers/Penulis.php

SELECT *
FROM `penulis`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `penulis`
---
    public function index()
    {
        $pageSekarang = $this->request->getVar('page_penulis') ? $this->request->getVar('page_penulis') : 1;

        $kataKunci = $this->request->getVar('keyword');
        if ($kataKunci) {
            $penulis = $this->penulisModel->search($kataKunci);
        } else {
            $penulis = $this->penulisModel;
        }


        $data = [
            'title' => 'Daftar Penulis',
            //'penulis' => $this->penulisModel->findAll()
            'penulis' => $penulis->paginate(10, 'penulis'),